{
  "id": "npc_nv_denton_marris",
  "name": "Denton 'Denny' Marris",
  "faction": "mojave_locals",
  "homeRegion": "mojave",
  "currentRegion": "strip",
  "role": "Drifter / Small-Time Con Artist",
  "personality": "Charming, unreliable, emotionally dependent, convinced Jaymie will always forgive him.",
  "description": "Denton Marris grew up in the Mojave during the era when chems were handed out like candy by pre-war holdover clinics and traveling 'doctors'. He was hooked young, long before he understood what addiction was. He’s been clean, relapsed, clean again, and stuck in the cycle ever since. He survives by conning tourists out of worthless old-world money, insisting it’s still valuable.",
  "traits": [
    "Former junkie still struggling with addiction",
    "Believes he’s a victim of circumstance, not choices",
    "Loves Jaymie but takes her for granted",
    "Thinks the Strip owes him something",
    "Talks big, delivers little"
  ],
  "catchphrase": "C’mon, babe… I’m workin’ on it.",
  "questHooks": [
    "Jaymie worries he’s in trouble with a Strip loan shark.",
    "Denton owes caps to a Gomorrah pit boss after a bad con.",
    "He found a strange glowing cap and thinks it’s worth a fortune.",
    "He’s convinced someone is following him — he might be right."
  ],
  "relationships": {
    "jaymie_netterfield": "He genuinely loves her, but assumes she’ll always be there no matter how badly he messes up.",
    "streetContacts": "A loose network of Strip hustlers and drifters.",
    "debtors": "Several casino enforcers who want their money back."
  },
  "backstory": {
    "childhood": "Given prescription chems as a kid for 'behavior issues' by a traveling clinic. Never stood a chance.",
    "addiction": "Still struggles, still hides it, still thinks he can quit anytime.",
    "survival": "Runs small cons on tourists, trading worthless old-world bills for caps.",
    "denial": "Believes he’s one big break away from turning his life around."
  },
  "poi": "The Strip — near the Tops, working the crowds"
}
