[
  {
    "name": "BONK",
    "symbol": "BONK",
    "mint": "DezXAZ8z7PnrnYkZq2qkJc9EwP6KDAdPD8YGtXgZtP6",
    "icon": "/wallet/icons/bonk.png",
    "description": "The rowdiest dog faction in the wasteland. BONK Raiders roam the highways looking for trouble.",
    "lore": "Legends say BONK Raiders were once courier dogs who mutated into fearless wasteland warriors."
  },
  {
    "name": "Dogwifhat",
    "symbol": "WIF",
    "mint": "Es9vMFrzaCERp5uWZLxE3obVhtSGcVwqDAVBBusfvEv",
    "icon": "/wallet/icons/wif.png",
    "description": "A mysterious traveler wearing a hat. Followers of WIF believe the hat holds ancient power.",
    "lore": "Some say the hat is older than the wasteland itself. Others say it whispers coordinates."
  },
  {
    "name": "Shiba Inu",
    "symbol": "SHIB",
    "mint": "SHIB_MINT_ADDRESS_HERE",
    "icon": "/wallet/icons/shib.png",
    "description": "A loyal nomadic clan wandering the wasteland. Known for honor, trade, and fierce protection.",
    "lore": "Shiba caravans travel between settlements, offering rare goods and ancient wisdom."
  },
  {
    "name": "FLOKI",
    "symbol": "FLOKI",
    "mint": "FLOKI_MINT_ADDRESS_HERE",
    "icon": "/wallet/icons/floki.png",
    "description": "Viking‑coded explorers who believe the wasteland is theirs to conquer.",
    "lore": "The Floki clans carve runes into the ruins of old cities, marking territory and prophecy."
  },
  {
    "name": "PEPE",
    "symbol": "PEPE",
    "mint": "PEPE_MINT_ADDRESS_HERE",
    "icon": "/wallet/icons/pepe.png",
    "description": "A chaotic meme cult that leaves strange caches hidden across the wasteland.",
    "lore": "Pepe shrines appear overnight. No one knows who builds them, or why."
  },
  {
    "name": "USDC",
    "symbol": "USDC",
    "mint": "EPjFWdd5AufqSSqeM2qN1xzybapC8G4wEGGkZwyTDt1v",
    "icon": "/wallet/icons/usdc.png",
    "description": "Stable currency used by caravans and traders across the wasteland.",
    "lore": "Caravans trust USDC because it never mutates, never fluctuates, and never lies."
  },
  {
    "name": "Solana",
    "symbol": "SOL",
    "mint": "So11111111111111111111111111111111111111112",
    "icon": "/wallet/icons/sol.png",
    "description": "The lifeblood of all wasteland tech. Everything runs on SOL.",
    "lore": "Ancient terminals still hum with Solana energy, long after the old world fell."
  }
]
